Tekla Open API Reference for Tekla Structures 2025
Operation.CreateBentPlateByFaces Method
Overload List
Name | Description
CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. See CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, BentPlate.BendShape).
CreateBentPlateByFaces(Part, Face, Part, Face)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. See CreateBentPlateByFaces(Part, Face, Part, Face, BentPlate.BendShape).
CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, Double)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts, selected faces in each part and radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, BentPlate.BendShape)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, BentPlate.BendShape).
CreateBentPlateByFaces(Part, Face, Part, Face, Double)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part and radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, Double).
CreateBentPlateByFaces(Part, Face, Part, Face, BentPlate.BendShape)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, LineSegment, ConnectiveGeometry, LineSegment, BentPlate.BendShape).
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace